{"title":"关于 2019 和 2020","date":"2020-01-01T12:20:24.000Z","thumbnail":"http://cdn.1ouo1.com/f7fnl.png","slug":"2020","comments":true,"tags":["B"],"updated":"2020-01-01T16:21:35.000Z","content":"<p>2019 相比往年的确跌宕和非凡，但笔耕久辍，一杯长岛下肚，竟然想不起辨不清过去一年里的林林总总。</p>\n<a id=\"more\"></a>\n<p>那就只挑一件小事说说吧。</p>\n<p>2019 下半年，我换了本职工作。这个准备实际从 2018 年中就开始了。关系近的朋友得知我虽还做产品设计，但准备跨到一个气氛相对冷清的行业，甚至还十分笃定地认准了一家坊间传言过得并不太好的公司，多有劝阻，我在感谢之余都付之一笑：喜欢，看好，抄个底。</p>\n<p>跨行业嘛，而且既然寄人篱下，那就事先把雇主的担心先打消了吧：</p>\n<blockquote>\n<ul>\n<li>行儿里的知识懂吗？</li>\n</ul>\n</blockquote>\n<p>我于是默默用上百个深夜，完成了台湾大学关于「机器学习」、「深度学习」和「增强式学习」三套专业课的学习，同时把每一节课都进行了自己的白话版叙述，发布在<a href=\"https://talk2.it\">这里</a>。如果你有心学习相关内容，这些白话叙述，相信可以给你提供更低门槛的帮助。（距离下一篇草稿整理成正文上线的时间不远了！🙈）</p>\n<p>同时收集和研究了这个行业里既有的相关开发文档、软硬件产品、用户和应用场景、相关开发资源、相关设计资源、相关文创内容等等，编辑成了行业资料站，你可以在<a href=\"https://ar.talk2.it\" target=\"_blank\" rel=\"noopener\">这里</a>随时看到。</p>\n<blockquote>\n<ul>\n<li>我们的工作流了解吗？</li>\n</ul>\n</blockquote>\n<p>我于是默默在一年中从各个渠道（当然，为了曾经莫名其妙的保密和惊喜，有意躲开了跟这个公司相关的所有人）找了行业里了的老鸟和前辈们，了解了行业里主要头部公司的工作流，并抽象出了一般框架。当然，附属地也输出了一个硬件开发流相对于软件开发流异同的内容，你可以在<a href=\"https://talk2.it/post/hardware\">这里</a>看到。过程中很有意思，好几位前辈表示十分被我的行为触动（是啊，我他妈也没听说过这么寻饭碗的），愿意为我作这份工作的推荐，我都一一感谢：（这怎么能行！我还得保密呢）谢谢前辈，我相信自己能搞定。</p>\n<blockquote>\n<ul>\n<li>… …</li>\n</ul>\n</blockquote>\n<p>该有的知识都有了，直接出个活儿当见面礼呗？没问题，我从服务端到客户端整体输出了该行业的一套落地产品设计稿（不好意思，这个就真不能放出来看了😶），后来这个稿子被我拿去签了保密协议，直接找开发团队执行了，当面很顺利地聊好了交付周期和报价。</p>\n<p>我甚至还找大刘一起制作了一段描述行业远景的 <a href=\"http://cdn.1ouo1.com/glass\" target=\"_blank\" rel=\"noopener\">CG 小片</a>来走心。你可能也看到过了。</p>\n<p>更别提为了如此明确的目标做了一整年准备的最后，很自然可以地，也必须地，如同情书般地写了一封好似奔向胜利的简历（这个简历你目前从<a href=\"https://talk2.it/\"> talk2.it </a>的某个角落里，是可以找到的）。</p>\n<p>我的准备工作，截止到扪心自问，我找不到理由来拒绝这样一个奔向自己的 Bingo 时，我准备出击了。</p>\n<p>很可惜的是，这个故事的最精彩的部分已经说完了，后面我被以一种不太能接受的借口和传达方式（显然是多轮反复地）甚至没有得到一个尝试的机会。</p>\n<p>这就很像 2019 的缩影了不是吗？总有一个时候，你以为雨过天晴甚至风和日丽，但是一个意料之外的变数会将你的所有计划和成果覆灭，顺带把你的三观震碎。</p>\n<p>这个故事到这儿就应该被收尾了，我还得做正经的总结和展望呢：后来，我把简历里没用上的见面彩蛋（什么？我以为你找到并且看了这个令人羞耻的简历）拿出来注册了发明专利，目前已经委托华进（ACIP）递交到国家知识产权局福州专利局，开始了实审流程。</p>\n<p>对了，因为这个网站，我还遇到了一些有意思的事情，比如甚至还收了逼哥团队的律师函😑</p>\n<div class=\"article-img\"><p><img src=\"http://cdn.1ouo1.com/qig2a.PNG\" alt data-zoomable></p></div>\n<p>原因是我的站上放了逼哥的歌和影像，当然我也很猥琐地借了逼哥无法抛头露面的不便噎了叁叁肆…实在抱歉啊，逼哥。希望早日复出，内容我将即刻删除。</p>\n<p>对了，再后来呢，我用上面那个故事（他不嫌弃我追别人哈哈哈哈或）感动了我现在的老板。显然，情感和价值观上的契合比什么都令人开心和温暖。我愿意像多年前的转行一样，做好准备历经所有的看轻、鄙夷、教训和怀疑，快速能拉伙计们做出一些让自己和大家亮眼的东西，甚至过程中进一步用产品（我说的是观念，老王🙂）默默补强老板的偶像级企业家人设。</p>\n<p>好了，<a href=\"https://mp.weixin.qq.com/s/-jQAoL3GzAYXuTHRe-hNww\" target=\"_blank\" rel=\"noopener\">回顾 2019 </a>：<br>\n该学的课程完结了；</p>\n<p>由于加入了飞行公司，入坑了 FPV，家里的 3D 打印机对于配件制作更加不可或缺了，就是晚上声儿有点大，琢磨弄个静音主板来优化一下；</p>\n<p>定投依然在保持，收益已经开始让我这个毫无财商的人又开始萌生幻想。</p>\n<p>减重嘛…<br>\n<img src=\"http://cdn.1ouo1.com/5rscn.JPG\" alt></p>\n<p>2020 不准备立太多目标：</p>\n<ol>\n<li>\n<p>夏天还得例行瘦一下（不定多少斤，恢复到能扣篮即可），只不过这一次是为自己；</p>\n</li>\n<li>\n<p>干一行爱一行，飞行相关视频需要常更，最少两周一个吧。</p>\n</li>\n</ol>\n<p>2020，开始吧。</p>\n","next":{"title":"聊明白机器学习 | 五. 分类（Classification）　","slug":"classification"},"link":"https://talk2.it/post/2020/","reward":true}